FireVirtuozz/ESP32/server/components/sensorsLib/sensorsLib.c
    //setup bmp
    uint8_t pwr_bmp_data[] = {0xF4, 0x00};
    //normal mode
    pwr_bmp_data[1] |= 1 << 0;
    pwr_bmp_data[1] |= 1 << 1;

    //measure p : ultra low power, 16bit/2.26Pa resolution
    pwr_bmp_data[1] |= 1 << 2;

    //measure T : ultra low power, 16bit/0.005°C resolution
    pwr_bmp_data[1] |= 1 << 5;

    //see in 3.4 - filter selection (doc) for example applications config

    err = i2c_master_transmit(bmp_handle, pwr_bmp_data, sizeof(pwr_bmp_data), -1);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) waking up bmp", esp_err_to_name(err));
        return err;
    }

    vTaskDelay(pdMS_TO_TICKS(100)); //wait for config setup

    //device identifier
    uint8_t reg_bmp = 0xD0;
    uint8_t who_bmp;
    err = i2c_master_transmit_receive(bmp_handle, &reg_bmp, 1, &who_bmp, 1, -1);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) getting who am i bmp", esp_err_to_name(err));
        return err;
    }
    log_msg(TAG, "WHO_AM_I bmp: 0x%02X", who_bmp);

    //calibration temperature
    uint8_t reg_dig_t = 0x88;
    uint8_t buf_dig_t[6];
    err = i2c_master_transmit_receive(bmp_handle, &reg_dig_t, 1, buf_dig_t, sizeof(buf_dig_t), -1);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) receiving mpu info", esp_err_to_name(err));
        return err;
    }
    
    cal_dig_t.dig_T1 = buf_dig_t[0] | (buf_dig_t[1] << 8);
    cal_dig_t.dig_T2 = (int16_t)(buf_dig_t[2] | (buf_dig_t[3] << 8));
    cal_dig_t.dig_T3 = (int16_t)(buf_dig_t[4] | (buf_dig_t[5] << 8));

    //calibration pressure
    uint8_t reg_dig_p = 0x8E;
    uint8_t buf_dig_p[18];
    err = i2c_master_transmit_receive(bmp_handle, &reg_dig_p, 1, buf_dig_p, sizeof(buf_dig_p), -1);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) reading pressure calib", esp_err_to_name(err));
        return err;
    }

    cal_dig_p.dig_P1 =          buf_dig_p[0]  | ((uint16_t)buf_dig_p[1]  << 8);
    cal_dig_p.dig_P2 = (int16_t)(buf_dig_p[2]  | ((uint16_t)buf_dig_p[3]  << 8));
    cal_dig_p.dig_P3 = (int16_t)(buf_dig_p[4]  | ((uint16_t)buf_dig_p[5]  << 8));
    cal_dig_p.dig_P4 = (int16_t)(buf_dig_p[6]  | ((uint16_t)buf_dig_p[7]  << 8));
    cal_dig_p.dig_P5 = (int16_t)(buf_dig_p[8]  | ((uint16_t)buf_dig_p[9]  << 8));
    cal_dig_p.dig_P6 = (int16_t)(buf_dig_p[10] | ((uint16_t)buf_dig_p[11] << 8));
    cal_dig_p.dig_P7 = (int16_t)(buf_dig_p[12] | ((uint16_t)buf_dig_p[13] << 8));
    cal_dig_p.dig_P8 = (int16_t)(buf_dig_p[14] | ((uint16_t)buf_dig_p[15] << 8));
    cal_dig_p.dig_P9 = (int16_t)(buf_dig_p[16] | ((uint16_t)buf_dig_p[17] << 8));

    log_msg(TAG, "MPU9250 initialized");

    return ESP_OK;
}

//convert function from bosch
static esp_err_t convert_temperature(int32_t *raw_temp) {

    int32_t v1, v2, T;
    v1 = (((*raw_temp >> 3) - ((int32_t)cal_dig_t.dig_T1 << 1)) * (int32_t)cal_dig_t.dig_T2) >> 11;
    v2 = (((((*raw_temp >> 4) - (int32_t)cal_dig_t.dig_T1) *
        ((*raw_temp >> 4) - (int32_t)cal_dig_t.dig_T1)) >> 12) * (int32_t)cal_dig_t.dig_T3) >> 14;
    t_fine = v1 + v2;
    T = (t_fine * 5 + 128) >> 8;

    *raw_temp = T;

    return ESP_OK;
}

/**
 * Convert raw BMP280 pressure ADC to Pa (int32 version, datasheet BST-BMP280-DS001)
 * MUST be called AFTER convert_temperature() — using t_fine
 * @param raw_pressure in/out 32 bit pressure
 */
static esp_err_t convert_pressure(int32_t *raw_pressure) {
    if (raw_pressure == NULL) return ESP_ERR_INVALID_ARG;

    int32_t  var1, var2;
    uint32_t p;
    
    var1 = ((int32_t)t_fine >> 1) - (int32_t)64000;
    var2 = (((var1 >> 2) * (var1 >> 2)) >> 11) * (int32_t)cal_dig_p.dig_P6;
    var2 = var2 + ((var1 * (int32_t)cal_dig_p.dig_P5) << 1);
    var2 = (var2 >> 2) + ((int32_t)cal_dig_p.dig_P4 << 16);
    var1 = (((int32_t)cal_dig_p.dig_P3 * (((var1 >> 2) * (var1 >> 2)) >> 13) >> 3)
            + (((int32_t)cal_dig_p.dig_P2 * var1) >> 1)) >> 18;
    var1 = ((32768 + var1) * (int32_t)cal_dig_p.dig_P1) >> 15;

    if (var1 == 0) {
        log_msg(TAG, "Pressure: division by zero, check P1 calibration");
        return ESP_ERR_INVALID_STATE;
    }

    p = (uint32_t)((int32_t)1048576 - *raw_pressure);
    p = (p - (uint32_t)(var2 >> 12)) * 3125;

    if (p < 0x80000000U) {
        p = (p << 1) / (uint32_t)var1;
    } else {
        p = (p / (uint32_t)var1) * 2;
    }

    var1 = ((int32_t)cal_dig_p.dig_P9 * (int32_t)(((p >> 3) * (p >> 3)) >> 13)) >> 12;
    var2 = ((int32_t)(p >> 2) * (int32_t)cal_dig_p.dig_P8) >> 13;
    p = (uint32_t)((int32_t)p + ((var1 + var2 + cal_dig_p.dig_P7) >> 4));

    *raw_pressure = (int32_t)p; 
    return ESP_OK;
}

/**
 * Getting MPU info
 * @returns ESP_OK success, others error 
 */
esp_err_t get_mpu_info(mpu_info_t *mpu_info) {
    if (mpu_info == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    esp_err_t err;

    uint8_t reg = 0x3B;
    uint8_t buf[14];  // 14 bytes : accel(6) + temp(2) + gyro(6)
    err = i2c_master_transmit_receive(mpu_handle, &reg, 1, buf, sizeof(buf), -1);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) receiving mpu info", esp_err_to_name(err));
        return err;
    }

    uint8_t reg_bmp = 0xF7;
    uint8_t buf_bmp[6];  // 6 bytes : temp(3) + pressure(3)
    err = i2c_master_transmit_receive(bmp_handle, &reg_bmp, 1, buf_bmp, sizeof(buf_bmp), -1);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) receiving mpu info", esp_err_to_name(err));
        return err;
    }

    mpu_info->accel_x = ((uint16_t)buf[0]  << 8) | buf[1];
    mpu_info->accel_y = ((uint16_t)buf[2]  << 8) | buf[3];
    mpu_info->accel_z = ((uint16_t)buf[4]  << 8) | buf[5];
    mpu_info->temp_mpu    = ((uint16_t)buf[6]  << 8) | buf[7];
    mpu_info->gyro_x  = ((uint16_t)buf[8]  << 8) | buf[9];
    mpu_info->gyro_y  = ((uint16_t)buf[10] << 8) | buf[11];
    mpu_info->gyro_z  = ((uint16_t)buf[12] << 8) | buf[13];

    //xlsb : first four bytes [7:4]
    mpu_info->pressure = (buf_bmp[0] << 12) | (buf_bmp[1] << 4) | (buf_bmp[2] >> 4); //20 bits word
    mpu_info->temp_bmp = (buf_bmp[3] << 12) | (buf_bmp[4] << 4) | (buf_bmp[5] >> 4);

    err = convert_temperature(&mpu_info->temp_bmp);
    if (err != ESP_OK) return err;

