FireVirtuozz/ESP32/server/components/sensorsLib/sensorsLib.c
    err = convert_pressure(&mpu_info->pressure);
    if (err != ESP_OK) return err;

    //other formulas on datasheet

    return ESP_OK;
}

#define MPU_PAYLOAD_SIZE (7 * sizeof(int16_t) + 2 * sizeof(int32_t))

static void serialize_mpu(mpu_info_t *mpu, uint8_t *buf) {
    uint16_t len = HEADER_SENSOR_SIZE;
    memcpy(&buf[len] ,&mpu->accel_x, sizeof(int16_t));
    len += sizeof(int16_t);
    memcpy(&buf[len] ,&mpu->accel_y, sizeof(int16_t));
    len += sizeof(int16_t);
    memcpy(&buf[len] ,&mpu->accel_z, sizeof(int16_t));
    len += sizeof(int16_t);
    memcpy(&buf[len] ,&mpu->gyro_x, sizeof(int16_t));
    len += sizeof(int16_t);
    memcpy(&buf[len] ,&mpu->gyro_y, sizeof(int16_t));
    len += sizeof(int16_t);
    memcpy(&buf[len] ,&mpu->gyro_z, sizeof(int16_t));
    len += sizeof(int16_t);
    memcpy(&buf[len] ,&mpu->temp_mpu, sizeof(int16_t));
    len += sizeof(int16_t);
    memcpy(&buf[len] ,&mpu->pressure, sizeof(int32_t));
    len += sizeof(int32_t);
    memcpy(&buf[len] ,&mpu->temp_bmp, sizeof(int32_t));
}

/**
 * 50 ms monitoring MPU task
 */
static void mpu_task(void * params) {
    esp_err_t err;
    mpu_info_t mpu_info;

    err = init_mpu();
    if (err != ESP_OK){
        return;
    }

    while (monitoring)
    {
        err = get_mpu_info(&mpu_info);

        if (err == ESP_OK) {
            header_sensor_t header = {0};
            header.esp_id = (uint8_t)CONFIG_ESP_ID;
            header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
            header.type = 2;
            uint8_t buf[HEADER_SENSOR_SIZE + MPU_PAYLOAD_SIZE];
            serialize_header(&header, buf);
            serialize_mpu(&mpu_info, buf);
            
        #if CONFIG_USE_UDPLIB
            send_udp_sensor(buf, sizeof(buf));
        #endif
        #if CONFIG_USE_ESPNOW
        #endif
        }

        vTaskDelay(pdMS_TO_TICKS(MPU_PERIOD));
    }
    vTaskDelete(NULL);
}
#endif

esp_err_t init_sensors() {

    esp_err_t err;
    BaseType_t res;

    if (monitoring) {
        log_msg_lvl(ESP_LOG_WARN, TAG, "Sensors already initialized");
        return ESP_FAIL;
    }

#if CONFIG_USE_HCSR04
    int64_t echo_temp = 0, echo_res = 0;
    res = xTaskCreate(hc_task, "hc_monitoring", 2048, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating HC monitoring task", res);
        return ESP_FAIL;
    }
#endif

#if CONFIG_USE_INA226
    ina_info_t ina = {0}, ina_temp;
    res = xTaskCreate(ina_task, "ina_monitoring", 2048, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating INA monitoring task", res);
        return ESP_FAIL;
    }
#endif

#if CONFIG_USE_MPU9250
    mpu_info_t mpu = {0}, mpu_temp;
    res = xTaskCreate(mpu_task, "mpu_monitoring", 2048, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating mpu monitoring task", res);
        return ESP_FAIL;
    }
#endif

#if CONFIG_USE_KY003
    err = init_ky();
    if (err != ESP_OK){
        return ESP_FAIL;
    }
    ky_info_t ky = {0}, ky_temp;
    res = xTaskCreate(ky_task, "ky_monitoring", 2048, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%d) creating KY monitoring task", res);
        return ESP_FAIL;
    }
#endif

    monitoring = true;
    return ESP_OK;
}